In [138]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [139]:
for index, row in df.iterrows():
   print row['c1'], row['c2']

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(row['c1'], row['c2'])? (<ipython-input-139-19ea20c26152>, line 2)

In [140]:
df = DataFrame(np.arange(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
D    10    11    12    13    14
E    15    16    17    18    19
F    20    21    22    23    24

In [141]:
df = DataFrame(np.arange(16).reshape((4,4)),index=['A','B','D','E'],columns=['name', 'age', 'state','point'])
df

   name  age  state  point
A     0    1      2      3
B     4    5      6      7
D     8    9     10     11
E    12   13     14     15

In [142]:
df['age'] = df['age'].map('{:02}'.format)
df['name'] = df['name'].map('{:02}'.format)
df['state'] = df['state'].map('{:02}'.format)
df['point'] = df['point'].map('{:02}'.format)

df

  name age state point
A   00  01    02    03
B   04  05    06    07
D   08  09    10    11
E   12  13    14    15

In [143]:
df

  name age state point
A   00  01    02    03
B   04  05    06    07
D   08  09    10    11
E   12  13    14    15

In [144]:
df['add'] = pd.Series(['a', 'b', np.nan, 'd']).str.cat(sep='')
df

  name age state point  add
A   00  01    02    03  abd
B   04  05    06    07  abd
D   08  09    10    11  abd
E   12  13    14    15  abd

In [145]:
df['name-state'] = df['name'].str.cat(df['state'], sep='in')
df

  name age state point  add name-state
A   00  01    02    03  abd     00in02
B   04  05    06    07  abd     04in06
D   08  09    10    11  abd     08in10
E   12  13    14    15  abd     12in14

In [146]:
#df['name-state-point'] = df['name'].str.cat(df['state'], sep='in').str.cat(df['point'], sep='in')
df['name-state-point'] = df['name'].str.cat(df['state']).str.cat(df['point'])
df

  name age state point  add name-state name-state-point
A   00  01    02    03  abd     00in02           000203
B   04  05    06    07  abd     04in06           040607
D   08  09    10    11  abd     08in10           081011
E   12  13    14    15  abd     12in14           121415

In [147]:
new_index = df['name-state-point']
new_index.values

array(['000203', '040607', '081011', '121415'], dtype=object)

In [148]:
df2 = df.reindex(new_index.values)
df2

       name  age state point  add name-state name-state-point
000203  NaN  NaN   NaN   NaN  NaN        NaN              NaN
040607  NaN  NaN   NaN   NaN  NaN        NaN              NaN
081011  NaN  NaN   NaN   NaN  NaN        NaN              NaN
121415  NaN  NaN   NaN   NaN  NaN        NaN              NaN

In [149]:
df2['name'] = 'aa'
df2['age'] = 'bb'
df2['state'] = 'cc'
df2['point'] = 'dd'

In [150]:
df2

       name age state point  add name-state name-state-point
000203   aa  bb    cc    dd  NaN        NaN              NaN
040607   aa  bb    cc    dd  NaN        NaN              NaN
081011   aa  bb    cc    dd  NaN        NaN              NaN
121415   aa  bb    cc    dd  NaN        NaN              NaN

In [163]:
df2.iloc[[1],[3]]

       point
040607    dd

In [166]:
df2.loc['081011','name']

'aa'